Repository: rmraya/Terms
Catalog: Localization/terms.tmx
Source language: en
Languages: es

source: \#,term,score,casing,position,frequency,relevance,relatedness,different
es: #,término,puntaje,capitalización,posición,frecuencia,relevancia,relación,diferente

source: Usage: termExtractor [-version] [-help] -xliff xliffFile [-output outputFile] [-minFreq frequency] [-maxLength length] [-maxScore score] [-relevant] [-debug] Where: -version: (optional) Display version information and exit -help: (optional) Display this usage information and exit -xliff: The XLIFF file to process -output: (optional) The output file where the terms will be written -maxLength: (optional) The maximum number of words in a term. Default: 3 -minFreq: (optional) The minimum frequency for a term to be considered. Default: 3 -maxScore: (optional) The maximum score for a term to be considered. Default: 10.0 -relevant: (optional) Exclude single-word terms (only show multi-word terms and proper nouns). Default: false -debug: (optional) Enable debug mode with detailed logging. Default: false
es: Uso: termExtractor [-version] [-help] -xliff archivoXliff [-output archivoCsv] [-minFreq frecuencia] [-maxLength largo] [-maxScore puntaje] [-relevant] [-debug] Donde: -version: (opcional) Mostrar información de versión y salir -help: (opcional) Mostrar esta información de uso y salir -xliff: Archivo XLIFF a procesar -output: (opcional) Archivo en donde guardar los términos -maxLength: (opcional) Máximo número de palabras en un término. Predeterminado: 3 -minFreq: (opcional) Frecuencia mínima para considerar un término. Predeterminado: 3 -maxScore: (opcional) Puntaje máximo para considerar un término. Predeterminado: 10.0 -relevant: (opcional) Excluir términos de una palabra (solo mostrar términos compuestos y nombres propios). Predeterminado: false -debug: (opcional) Habilitar modo de depuración con registros detallados. Predeterminado: false

source: Selected file is not an XLIFF 2.x document
es: El archivo seleccionado no es un documento XLIFF 2.x

source: Version: {0} Build: {1}
es: Versión: {0} Compilación: {1}

source: Exception {0} was thrown while processing XLIFF file {1}
es: Una excepción {0} se recibió al procesar el archivo XLIFF {1}

source: Minimum frequency must be at least 1
es: La frecuencia mínima debe ser al menos 1

source: Maximum score must be greater than 0
es: La puntuación máxima debe ser mayor que 0

source: Maximum term length must be at least 1
es: La longitud máxima del término debe ser al menos 1

source: File not found: {0}
es: Archivo no encontrado: {0}

source: Replacing ''{0}'' with ''{1}'' (better score/frequency)
es: Reemplazando ''{0}'' por ''{1}'' (mejor puntuación/frecuencia)

source: Merging similar terms: ''{0}'' and ''{1}''
es: Fusionando términos similares: ''{0}'' y ''{1}''

source: Deduplication: {0} terms -> {1} terms (removed {2} duplicates)
es: Deduplicación: {0} términos -> {1} términos (eliminados {2} duplicados)

source: Usage: bilingualExtractor [-version] [-help] -xliff xliffFile [-output outputFile] [-minFreq frequency] [-maxLength length] [-maxScore score] [-minCoOccurrence N] [-maxPairs N] [-minCoOccurrenceRatio ratio] [-debug] Where: -version: (optional) Display version information and exit -help: (optional) Display this usage information and exit -xliff: The XLIFF file to process (must contain translated segments) -output: (optional) The output CSV file for term pairs. Default: <xliff>_bilingual.csv -maxLength: (optional) The maximum number of words in a term. Default: 5 -minFreq: (optional) The minimum frequency for a term to be considered. Default: 3 -maxScore: (optional) The maximum score for a term to be considered. Default: 10.0 -minCoOccurrence: (optional) Minimum number of shared segments for term pairs. Default: 1 -maxPairs: (optional) Maximum number of target terms per source term (0 = no limit). Default: 0 -minCoOccurrenceRatio: (optional) Minimum ratio of co-occurrence to term frequency (0.0-1.0). Default: 0.7 -debug: (optional) Enable debug mode with detailed logging. Default: false Note: Only multi-word terms and proper nouns are extracted for bilingual term pairs.
es: Uso: bilingualExtractor [-version] [-help] -xliff archivoXliff [-output archivoCsv] [-minFreq frecuencia] [-maxLength largo] [-maxScore puntaje] [-minCoOccurrence N] [-maxPairs N] [-minCoOccurrenceRatio ratio] [-debug] Donde: -version: (opcional) Mostrar información de versión y salir -help: (opcional) Mostrar esta información de uso y salir -xliff: Archivo XLIFF a procesar (debe contener segmentos traducidos) -output: (opcional) Archivo CSV de pares de términos. Predeterminado: <xliff>_bilingual.csv -maxLength: (opcional) Máximo número de palabras en un término. Predeterminado: 5 -minFreq: (opcional) Frecuencia mínima para considerar un término. Predeterminado: 3 -maxScore: (opcional) Puntaje máximo para considerar un término. Predeterminado: 10.0 -minCoOccurrence: (opcional) Número mínimo de segmentos compartidos para pares de términos. Predeterminado: 1 -maxPairs: (opcional) Número máximo de términos objetivo por término origen (0 = sin límite). Predeterminado: 0 -minCoOccurrenceRatio: (opcional) Proporción mínima de co-ocurrencia a frecuencia del término (0.0-1.0). Predeterminado: 0.7 -debug: (opcional) Habilitar modo de depuración con registros detallados. Predeterminado: false Nota: Solo se extraen términos compuestos y nombres propios para pares de términos bilingües.

source: Minimum co-occurrence must be at least 1
es: La co-ocurrencia mínima debe ser al menos 1

source: Maximum pairs cannot be negative
es: El máximo de pares no puede ser negativo

source: Minimum co-occurrence ratio must be between 0.0 and 1.0
es: La relación mínima de co-ocurrencia debe estar entre 0.0 y 1.0

source: Bilingual term extraction completed. Output: {0}
es: Extracción de términos bilingües completada. Salida: {0}

source: Error during extraction
es: Error durante la extracción

source: Source language: {0}, Target language: {1}
es: Idioma origen: {0}, Idioma destino: {1}

source: No segments with state='final' found in XLIFF file
es: No se encontraron segmentos con state='final' en el archivo XLIFF

source: Found {0} final segments
es: Se encontraron {0} segmentos finales

source: Extracted {0} source terms
es: Se extrajeron {0} términos de origen

source: Extracted {0} target terms
es: Se extrajeron {0} términos de destino

source: Generated {0} term pairs after filtering
es: Se generaron {0} pares de términos después del filtrado

source: Building map for {0} terms from {1} sentences
es: Construyendo mapa para {0} términos de {1} oraciones

source: Term ''{0}'' has NO sentence indices
es: El término ''{0}'' NO tiene índices de oración

source: Term ''{0}'' has out-of-bounds sentence index {1} (max {2})
es: El término ''{0}'' tiene un índice de oración fuera de límites {1} (máximo {2})

source: Term ''{0}'' appears in {1} segments
es: El término ''{0}'' aparece en {1} segmentos

source: Mapped {0} terms to segments ({1} had no sentences, {2} had out-of-bounds indices)
es: Se asignaron {0} términos a segmentos ({1} no tenían oraciones, {2} tenían índices fuera de límites)

source: Generating pairs from {0} source terms and {1} target terms
es: Generando pares de {0} términos de origen y {1} términos de destino

source: Found pair: ''{0}'' <-> ''{1}'' in {2} segments
es: Par encontrado: ''{0}'' <-> ''{1}'' en {2} segmentos

source: Generated {0} total pairs before filtering
es: Se generaron {0} pares totales antes del filtrado

source: Mutual best match filtering: {0} pairs -> {1} pairs
es: Filtrado de mejor coincidencia mutua: {0} pares -> {1} pares
